Repository: pexip/os-sensible-utils
Catalog: man/po4a/*.po
Languages: de, fr

source: sensible-editor - sensible editing
de: sensible-editor - vernünftiges Bearbeiten
fr: sensible-editor - edition pratique

source: SYNOPSIS
de: ÜBERSICHT

source: B<sensible-editor> [OPTIONS...]
de: B<sensible-editor> [OPTIONEN …]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<sensible-editor> makes sensible decisions on which editor to call. Programs in Debian can use this script as their default editor.
de: B<sensible-editor> trifft vernünftige Entscheidungen, welcher Editor aufgerufen wird. Programme in Debian können dieses Skript als ihren Standard-Editor benutzen.
fr: B<sensible-editor> prend des décisions sensées sur le choix de l'éditeur qu'il faut appeler. Les programmes de la distribution Debian peuvent utiliser ce scripts comme leur éditeur par défaut

source: B<sensible-editor> try to do in the following order:
de: B<sensible-editor> versucht Folgendes in nachfolgender Reihenfolge:
fr: B<sensible-editor> essaye de faire dans l'ordre suivant:

source: if B<VISUAL> environment variable exists, execute B<VISUAL [OPTIONS]>
de: Falls die Umgebungsvariable B<VISUAL> existiert, führt es B<VISUAL [OPTIONEN]> aus.
fr: si la variable d'environement B<VISUAL> existe, exécute B<VISUAL [OPTIONS]>

source: if B<EDITOR> environment variable exists, execute B<EDITOR\ [OPTIONS]>
de: Falls die Umgebungsvariable B<EDITOR> existiert, führt es B<EDITOR\ [OPTIONEN]> aus.
fr: si la variable d'environement B<EDITOR> existe, exécute B<EDITOR\ [OPTIONS]>

source: source the contents of file I<~/.selected_editor> and, if B<SELECTED_EDITOR> environment variable exists execute B<SELECTED_EDITOR\ [OPTIONS]>
de: Es liest den Inhalt der Datei I<~/.selected_editor> ein und führt, falls die Umgebungsvariable B<SELECTED_EDITOR> existiert, B<SELECTED_EDITOR\ [OPTIONEN]> aus.
fr: lit en tant que fichier source, le ficher I<~/.selected_editor> et, si la variabled'environement B<SELECTED_EDITOR> existe, exécute B<SELECTED_EDITOR\ [OPTIONS]>

source: run B<editor [OPTIONS]> command
de: Es führt B<editor [OPTIONEN]> aus.
fr: exécute la commande B<editor [OPTIONS]>

source: finally run B<nano-tiny [OPTIONS]> command
de: Schließlich wird B<nano-tiny [OPTIONEN]> ausgeführt.
fr: enfin exécute la commande B<nano-tiny [OPTIONS]>

source: SEE ALSO
de: SIEHE AUCH
fr: VOIR AUSSI

source: B<environ>(7) for documentation of the EDITOR, VISUAL variables
de: B<environ>(7) für die Dokumentation der Variablen EDITOR, VISUAL
fr: B<environ>(7) pour la documentation des variables EDITOR et VISUAL

source: B<select-editor>(1) for changing a user's default editor.
de: B<select-editor>(1) zum Ändern des Standards-Editors des Benutzers.
fr: B<select-editor>(1) pour changer l'éditeur par défaut d'un utilisateur

source: B<editor>(1) for default system wide editor.
de: B<editor>(1) für den systemweiten Vorgabe-Editor.
fr: B<editor>(1) pour l'éditeur du système par défauts

source: BUGS
de: FEHLER
fr: BOGUES

source: This command is protected against trivial fork bomb, when user set B<EDITOR=sensible-editor> wider loops are still possible.
de: Dieser Befehl ist gegen triviale Fork-Bomben geschützt. Wenn der Benutzer B<EDITOR=sensible-editor> setzt, sind weitere Schleifen noch möglich.
fr: Cette commande est protégé contre les boucle d'excécution par appel fork(2), cependant boucles sont encore possibles si l'utilisateur utilise comme valeur B<EDITOR=sensible-editor>.

source: Documentation of behavior of sensible-utils under a debian system is available under section 11.4 of debian-policy usually installed under /usr/share/doc/debian-policy (you might need to install debian-policy)
de: Die Beschreibung des Verhaltens der Sensible-Utils in einem Debian-System ist unter Abschnitt 11.4 der Debian-Policy erhältlich, die normalerweise unter /usr/share/doc/debian-policy installiert wird (Sie müssen ggf. debian-policy installieren).
fr: La documentation du comportement du paquet sensible-utils pour un système debian est disponible au titre 11.4 du manuel de la politique debian qui est usuellement installé sous /usr/share/doc/debian-policy (il convient d'installer le paquet debian-policy)

source: sensible-browser - sensible web browsing
de: sensible-browser - vernünftiges Web-Browsen
fr: sensible-browser - navigateur web pratique

source: B<sensible-browser> makes sensible decisions on which web browser to call. Programs in Debian can use this script as their default web browser or emulate their behavior.
de: B<sensible-browser> trifft vernünftige Entscheidungen, welcher Web-Browser aufgerufen wird. Programme in Debian können diese Skripte als ihren Standard-Web-Browser benutzen oder um dessen Verhalten zu emulieren.
fr: B<sensible-browser> prend des décisions sensées sur le choix du navigateur qu'il faut appeler. Les programmes de la distribution Debian peuvent utiliser ce scripts comme leur navigateur web par défaut

source: BROWSER environment variable could be set, and will be used if set.
de: Die Umgebungsvariable BROWSER könnte gesetzt sein und wird verwandt, falls sie gesetzt ist.
fr: La varible d'environement BROWSER peut être positionnée, et sera utilisée si elle est positionnée.

source: sensible-pager - sensible paging
de: sensible-pager - vernünftiges seitenweises Anzeigen
fr: sensible-editor - outil de mise en page (« pageur ») pratique

source: B<sensible-pager> [OPTIONS...]
de: B<sensible-pager> [OPTIONEN …]

source: B<sensible-pager> makes sensible decisions on which pager to call. Programs in Debian can use this script as their default pager, or emulate their behavior.
de: B<sensible-pager> trifft vernünftige Entscheidungen, welches Anzeigeprogramm (»pager«) aufgerufen wird. Programme in Debian können dieses Skript als ihr Standard-Seitenanzeigeprogramm benutzen oder um dessen Verhalten zu emulieren.
fr: B<sensible-page> prend des décisions sensées sur le choix de l'outil de mise en page (« pageur ») qu'il faut appeler. Les programmes de la distribution Debian peuvent utiliser ce scripts comme leur outil de mise en page par défaut

source: Documentation of the PAGER variable in B<environ>(7)
de: Dokumentation der Variable PAGER in B<environ>(7).
fr: Documentation de la variable d'environnement PAGER dans B<environ>(7)

source: 21 May 2008
de: 21. Mai 2008
fr: 21 Mai 2008

source: select-editor - select your default sensible-editor from all installed editors
de: select-editor - wählt Ihre Vorgabe für den vernünftigen Editor aus allen installierten Editoren aus
fr: select-editor - selectionne votre editeur sensible-editor à partir de la liste de tous les éditeurs installés

source: B<select-editor> provides a coherent mechanism for selecting and storing a preferred sensible-editor on a per-user basis. It lists the available editors on a system and interactively prompts the user to select one. The results are stored as SELECTED_EDITOR variable in ~/.selected_editor, which is sourced and used by B<sensible-editor> command. SELECTED_EDITOR variable is overridden by the VISUAL and EDITOR environment variables.
de: B<select-editor> bietet einen kohärenten Mechanismus zur benutzerbezogenen Auswahl und Speicherung eines bevorzugten vernünftigen Editors an. Es führt die verfügbaren Editoren auf einem System auf und fragt den Benutzer interaktiv, einen auszuwählen. Das Ergebnis wird in der Variablen SELECTED_EDITOR in ~/.selected_editor gespeichert, das vom Befehl B<sensible-editor>(1) eingelesen und verwandt wird. Die Variable SELECTED_EDITOR wird durch die Umgebungsvariablen VISUAL und EDITOR außer Kraft gesetzt.
fr: B<select-editor> fournie un mécanisme cohérent pour sélectionner et stocker un sensible-editor préféré par utilisateur. Il liste les editeurs disponibles sur le système et interactivement demande à un utilisateur d'en selectionner un. Le resultat est stocké sous la variable SELECTED_EDITOR dans le fichier ~/.selected_editor, qui est lu comme source et utilise par la commande B<sensible-editor>. La variable SELECTED_EDITOR est écrasée par les variables d'environement VISUAL and EDITOR.

source: AUTHOR
de: AUTOR
fr: AUTEUR

source: B<select-editor> was written by Dustin Kirkland E<lt>kirkland@canonical.comE<gt>.
de: B<select-editor> wurde von Dustin Kirkland E<lt>kirkland@canonical.comE<gt> geschrieben.
fr: B<select-editor> a été écrit by Dustin Kirkland E<lt>kirkland@canonical.comE<gt>.

source: 14 Nov 2018
fr: 14 novembre 2018

source: Debian
fr: Debian GNU/Linux

source: NAME
fr: NOM

source: 12 Jan 2020
fr: 12 Janvier 2020
